backend/artillery/tradeloadtest.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 10
      arrivalRate: 1
      name: Test
    # - duration: 60
    #   arrivalRate: 5
    #   name: Warm up
    # - duration: 120
    #   arrivalRate: 5
    #   rampTo: 50
    #   name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    #   name: Sustained load
  payload:
    - path: "trades.csv"
      fields:
        - "id"
        - "stock_id"
        - "user_id"
        - "stock_value"
        - "stock_amount"
        - "time_of_trade"
        - "trade_type"
        - "trade_status"
scenarios:
- name: "Create a new trade that is of trade_type 'Buy'"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "user"
          password: "Password1!"
        jar: true
    - post:
        url: "/user/validate"
        capture:
          json: "$.id"
          as: "id"
        jar: true
    - post:
        url: "/trade/buystocks"
        json: 
          user_id: "{{ id }}"
          stock_id: "{{ stock_id }}"
          stock_amount: "{{ stock_amount }}"
- name: "Create a new trade that is of trade_type 'Sell'"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "user"
          password: "Password1!"
        jar: true
    - post:
        url: "/user/validate"
        capture:
          json: "$.id"
          as: "id"
        jar: true
    - post:
        url: "/trade/sellstocks"
        json: 
          user_id: "{{ id }}"
          stock_id: "{{ stock_id }}"
          stock_amount: "{{ stock_amount }}"
- name: "Get transactions of the signed in user"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "user"
          password: "Password1!"
        jar: true
    - post:
        url: "/user/validate"
        capture:
          json: "$.id"
          as: "id"
        jar: true
    - post:
        url: "/trade/usertransactions"
        json: 
          user_id: "{{ id }}"
          stock_id: "{{ stock_id }}"
- name: "Convert a trade status from Pending to Approved when signed in as a Broker"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "broker"
          password: "Password1!"
        jar: true
    - get:
        url: "/trade/pendingtrades"
        capture:
          json: "$.[0].id"
          as: "id"
        jar: true
    - post:
        url: "/trade/approvetrade"
        json: 
         id: "{{ id }}"
- name: "Convert a trade status from Pending to Rejected when signed in as a Broker"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "broker"
          password: "Password1!"
        jar: true
    - get:
        url: "/trade/pendingtrades"
        capture:
          json: "$.results[0].id"
          as: "id"
        jar: true
    - post:
        url: "/trade/rejecttrade"
        json: 
         id: "{{ id }}"
- name: "Get a list of trades that share the same user and the same stock"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "broker"
          password: "Password1!"
        jar: true
    - post:
        url: "/user/validate"
        capture:
          json: "$.id"
          as: "id"
        jar: true
    - post:
        url: "/trade/stocktradesforuser"
        json: 
         user_id: "{{ id }}"
         stock_id: "{{ stockid }}"
- name: "Get a list of trades that share the same user and the same stock"
  flow:
    - post:
        url: "/user/signin"
        json: 
          username: "user"
          password: "Password1!"
        jar: true
    - post:
        url: "/trade/portfolio"