backend/artillery/tradeloadtest.yml
config:
  target: 'http://localhost:8000'
  phases:
    # - duration: 10
    #   arrivalRate: 5
    #   name: Test
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 15
      name: Ramp up load
    - duration: 600
      arrivalRate: 15
      name: Sustained load
  payload:
    - path: "trades.csv"
      fields:
        - "id"
        - "stock_id"
        - "user_id"
        - "stock_value"
        - "stock_amount"
        - "time_of_trade"
        - "trade_type"
        - "trade_status"
    - path: "stocks.csv"
      fields:
        - "id"
        - "symbol"
        - "name"
        - "value"
        - "volume"
        - "open"
        - "close"
        - "gains"
        - "latest_trade"
before:
  flow:
    - log: 'Get user auth tokens'
    - post:
        url: "/user/signin"
        json: 
          username: "user"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "user_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "user_data"
        headers: 
          Cookie: "{{ user_token }}"
    - post:
        url: "/user/signin"
        json: 
          username: "admin"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "admin_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "admin_data"
        headers: 
          Cookie: "{{ admin_token }}"
    - post:
        url: "/user/edit"
        json:
          username: "user"
          credit: 100000000
        headers: 
          Cookie: "{{ admin_token }}"
    - post:
        url: "/user/signin"
        json: 
          username: "broker"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "broker_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "broker_data"
        headers: 
          Cookie: "{{ broker_token }}"
    - get:
        url: "/stock/getOne?symbol={{ symbol }}"
        capture:
          json: "$.id"
          as: "captured_stock_id"
        headers: 
          Cookie: "{{ admin_token }}"
    - post:
        url: "/user/signin"
        json: 
          username: "loadtest"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "loadtest_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "loadtest_data"
        headers: 
          Cookie: "{{ loadtest_token }}"
    - loop:
      - post:
          url: "/trade/buystocks"
          json: 
            user_id: "{{ loadtest_data.id }}"
            stock_id: "{{ captured_stock_id }}"
            stock_amount: "1"
          headers: 
            Cookie: "{{ loadtest_token }}"
      count: 10
    - log: "stock id: {{ captured_stock_id }}"
    - log: "loadtest token: {{ loadtest_token }}"
    - log: "user token: {{ user_token }}"
    - log: "admin token: {{ admin_token }}"
    - log: "broker token: {{ broker_token }}"
scenarios:
- name: "Create a new trade that is of trade_type 'Buy'"
  flow:
  - post:
      url: "/trade/buystocks"
      json: 
        user_id: "{{ user_data.id }}"
        stock_id: "{{ captured_stock_id }}"
        stock_amount: "1"
      headers: 
        Cookie: "{{ user_token }}"
- name: "Create a new trade that is of trade_type 'Sell'"
  flow:
  - post:
      url: "/trade/buystocks"
      json: 
        user_id: "{{ user_data.id }}"
        stock_id: "{{ captured_stock_id }}"
        stock_amount: "1"
      capture:
        json: "$"
        as: "trade"
      headers: 
        Cookie: "{{ user_token }}"
  - post:
      url: "/trade/approvetrade"
      json: 
        id: "{{ trade.id }}"
      headers: 
        Cookie: "{{ broker_token }}"
  - post:
      url: "/trade/sellstocks"
      json: 
        user_id: "{{ user_data.id }}"
        stock_id: "{{ captured_stock_id }}"
        stock_amount: "1"
      headers: 
        Cookie: "{{ user_token }}"
- name: "Get transactions of the signed in user"
  flow:
    - get:
        url: "/trade/usertransactions?user_id={{ loadtest_data.id }}&stock_id={{ captured_stock_id }}"
        headers: 
          Cookie: "{{ loadtest_token }}"
- name: "Convert a trade status from Pending to Approved when signed in as a Broker"
  flow:
    - post:
        url: "/trade/buystocks"
        json: 
          user_id: "{{ user_data.id }}"
          stock_id: "{{ captured_stock_id }}"
          stock_amount: "1"
        capture:
          json: "$"
          as: "approvetrade"
        headers: 
          Cookie: "{{ user_token }}"
    - post:
        url: "/trade/approvetrade"
        json: 
         id: "{{ approvetrade.id }}"
        headers: 
          Cookie: "{{ broker_token }}"
- name: "Convert a trade status from Pending to Rejected when signed in as a Broker"
  flow:  
    - post:
        url: "/trade/buystocks"
        json: 
          user_id: "{{ user_data.id }}"
          stock_id: "{{ captured_stock_id }}"
          stock_amount: "1"
        capture:
          json: "$"
          as: "rejecttrade"
        headers: 
          Cookie: "{{ user_token }}"
    - post:
        url: "/trade/rejecttrade"
        json: 
         id: "{{ rejecttrade.id }}"
        headers: 
          Cookie: "{{ broker_token }}"
- name: "Get a list of trades that share the same user and the same stock"
  flow:
    - post:
        url: "/trade/buystocks"
        json: 
          user_id: "{{ user_data.id }}"
          stock_id: "{{ captured_stock_id }}"
          stock_amount: "1"
        headers: 
          Cookie: "{{ user_token }}"
    - post:
        url: "/trade/stocktradesforuser"
        json: 
         user_id: "{{ user_data.id }}"
         stock_id: "{{ captured_stock_id }}"
        headers: 
          Cookie: "{{ user_token }}"
- name: "Get user portfolio"
  flow:
    - get:
        url: "/trade/portfolio"
        headers: 
          Cookie: "{{ user_token }}"